Repository: pyrocumulus/dsmr-reader
Catalog: docs/locale/*/LC_MESSAGES/pvoutput.po
Languages: nl

source: Integration: PVOutput
nl: Integratie: PVOutput

source: Contents
nl: Inhoudsopgave

source: PVOutput.org: Automated electricity consumption export
nl: PVOutput.org: Automatisch exporteren van verbruik

source: *How can I link my PVOutput.org account?*
nl: *Hoe kan ik mijn PVOutput.org-account koppelen?*

source: Make sure you have a PVOutput.org account, or `signup for an account <https://pvoutput.org/>`_. You will have to configure your account and PV system(s). For any support doing that, please `see this page <https://pvoutput.org/help.html#overview-getting-started>`_ for more information.
nl: Zorg ervoor dat je een PVOutput.org-account hebt, of `registreer er een <https://pvoutput.org/>`_. Vervolgens zul je je account en zonnesystemen moeten configureren. Voor ondersteuning hoe dat moet, `zie de documentatie <https://pvoutput.org/help.html#overview-getting-started>`_ voor meer informatie.

source: In order to link DSMR-reader to your account, please write down the "API Key" and "System ID" from your PVOutput account. You can find them near the bottom of the "Settings" page in PVOutput.
nl: Om DSMR-reader te koppelen met je account, noteer de "API Key" en "System ID" zoals je PVOutput-account aangeeft. Deze zijn terug te vinden onder "Settings", binnen PVOutput.

source: Enter those values in DSMR-reader's admin pages, at "PVOutput: API configuration". Make sure to enter both:
nl: Vul deze gegevens in de configuratiepagina's van DSMR-reader in, bij: "PVOutput: API-configuratie". Zowel:

source: Now navigate to another settings page in DSMR-reader: "PVOutput: "Add Status" configuration".
nl: Navigeer nu naar een andere pagina met instellingen binnen DSMR-reader, genaamd "PVOutput: Add Status configuratie".

source: Enable uploading the consumption.
nl: Schakel het uploaden van je verbruik in.

source: Choose an interval between the uploads. You can configure this as well on the PVOutput's end, in Device Settings.
nl: Kies een interval tussen de uploads. Je kunt dit tevens instellen aan de kant van PVOutput, onder Device Settings.

source: Optionally, choose an upload delay X (in minutes). If set, DSMR-reader will not use data of the past X minutes.
nl: Voer optioneel een uploadvertraging X in. Wanneer ingesteld, zal DSMR-reader geen data gebruiken van de afgelopen X minuten.

source: Optionally, you can choose to enter a **processing delay in minutes** for PVOutput. Please note that PVOutput will only allow this when you have a **"Donation" account** on their website. If you do not have one, they will reject each API call you make, until you disable (clear) this option in DSMR-reader.
nl: Optioneel kun je ervoor kiezen om PVOutput de gegevens **vertraagd te laten verwerken**. Let op, dit is een feature van PVOutput die alleen beschikbaar is wanneer je daar een **"Donatie" account** hebt. Indien dat niet het geval is, zal PVOutput elke API-call weigeren, totdat je dit uitschakelt (veld leegmaakt) in DSMR-reader.

source: If you configured everything correctly, you should see some addional data in PVOutput listed under "Your Outputs" momentarily.
nl: Indien je alles correct hebt ingesteld, zul je op korte termijn extra gegevens moeten zien in PVOutput onder "Your Outputs".
