Repository: pyrocumulus/dsmr-reader
Catalog: docs/locale/*/LC_MESSAGES/requirements.po
Languages: nl

source: Requirements
nl: Vereisten

source: Contents
nl: Inhoudsopgave

source: *(Or similar. Raspbian is recommended and tested with, but any satisfying the requirements should do fine)*
nl: *(Of gelijkwaardig. Raspbian is aanbevolen en wordt mee getest, al zou elk OS die dezelfde vereisten ondersteunt prima moeten zijn)*

source: **Alternative #1**: You can also run it on any server near your smart meter, as long as it satisfies the other requirements.
nl: **Alternatief #1**: Je kunt dit natuurlijk ook draaien op een server vlakbij je slimme meter, zolang de vereisten maar ondersteund worden.

source: **Alternative #2**: The application supports receiving P1 telegrams using an API, so you can also run it on a server outside your home. (:doc:`API docs here<api>`)
nl: **Alternatief #2**: De applicatie ondersteunt het ontvangen van P1 telegrammen via een API, dus je kunt dit ook op een server buiten je huis draaien. (:doc:`API documentatie hier<api>`)

source: Hardware: ``RaspberryPi 3 or Linux server``
nl: Hardware: ``RaspberryPi 3 of Linux server``

source: The RaspberryPi 1 and 2 tend to be **too slow** for this project, as it requires multi core processing.
nl: De RaspberryPi 1 en 2 lijken **te traag** voor het draaien van dit project, aangezien meerdere processoren vereist zijn.

source: You can however run just the datalogger client on an old RaspberryPi, :doc:`see for the API for a howto and example scripts<api>`.
nl: Je kunt echter wel alleen een datalogger client draaien op een oude RaspberryPi, :doc:`zie de API-documentatie voor meer informatie en voorbeeldscripts<api>`.

source: Support for ``Python 3.3`` has been **discontinued** since ``DSMR-reader v1.5`` (due to Django).
nl: Ondersteuning voor ``Python 3.3`` is **vervallen** sinds ``DSMR-reader v1.5`` (vanwege Django).

source: Support for ``Python 3.4`` will be **discontinued** ``late 2018/begin 2019`` (due to Django & Python ``3.4`` End of Life).
nl: Ondersteuning voor ``Python 3.4`` **vervalt** ``eind 2018/begin 2019`` (vanwege Django & Python ``3.4`` End of Life).

source: Support for ``MySQL`` has been **deprecated** since ``DSMR-reader v1.6`` and will be discontinued completely in a later release. Please use a PostgreSQL database instead.
nl: Gebruik van ``MySQL`` wordt **afgeraden** sinds ``DSMR-reader v1.6`` en ondersteuning hiervoor verdwijnt helemaal in een toekomstige versie. Gebruik daarom PostgreSQL.

source: Disk space: ``1+ GB``
nl: Schijfruimte: ``1+ GB``

source: *(For application installation & virtualenv)*
nl: *(ten behoeve van de applicatie en VirtualEnv).*

source: More disk space is required for storing all reader data captured (optional). I generally advise to use an 8+ GB SD card, depending on whether you keep all readings stored.
nl: Meer schijfruimte is nodig voor het opslaan van alle metingen (optioneel). Over het algemeen adviseer ik minimaal een 8+ GB SD-kaart, afhankelijk van of je alle metingen bewaart.

source: The readings will take about 90+ percent of the disk space used by the application. You can enable retention to have all readings cleaned up periodically. This will make the application barely use any disk space at all (depending on your settings).
nl: De metingen nemen zo'n 90+ procent in van de door de applicatie gebruikte schijfruimte. Je kunt echter retentie inschakelen om de metingen periodiek op te schonen. Hierdoor gebruikt de applicatie relatief weinig schijfruimte (afhankelijk van je exacte instellingen).

source: P1 telegram cable
nl: P1 telegram kabel

source: **Smart Meter** with support for **at least DSMR 4.x+** and a **P1 telegram port**
nl: **Slimme meter** met ondersteuning voor **ten minste DSMR 4.x+** en een **P1 telegram poort**

source: **Smart meter P1 data cable** *(Can be purchased online and they cost around EUR 15,- to 20,-)*
nl: **Smart meter P1 data kabel** *(Kan online besteld worden en kost rond de EUR 15,- a 20,-)*
