Repository: pyrocumulus/dsmr-reader
Catalog: docs/locale/*/LC_MESSAGES/retention.po
Languages: nl

source: Retention
nl: Retentie

source: By default all DSMR-readings read by of sent to the application are stored indefinitely. DSMR v5 smart meters allow DSMR-readings to be recorded every second, resulting in over 30 million readings each year.
nl: Standaard worden alle DSMR-metingen oneindig bewaard. Deze zijn gelezen door (of opgestuurd naar) de applicatie. DSMR v5 slimme meters staan toe dat er elke seconde een meting gedaan wordt, waardoor er tot meer dan 30 miljoen metingen per jaar opgeslagen worden.

source: Eventually this **will cause degraded performance** in the application/database and for that reason you might want to apply retention to this data. Please note that enabling this feature will **not discard all readings**, as it will **preserve the first and last reading of each hour**.
nl: Uiteindelijk zorgt dit voor **slechtere performance** in ofwel de applicatie of database. Daarom zul je wellicht retentie willen toepassen op deze gegevens. Let op: Het inschakelen van deze feature **gooit niet alle metingen weg**, want **van elk uur wordt de eerste en laatste meting bewaard**.

source: Contents
nl: Inhoudsopgave

source: Notes / warnings
nl: Opmerkingen / waarschuwingen

source: The application will **slowly** apply retention **during night**, cleaning up a maximum of 24 hours worth of data on each backend run executed.
nl: Let op: De applicatie zal **langzaam** dataretentie toepassen **tijdens de nacht**, waarbij er telkens maximaal 24 uur aan gegevens wordt opgeschoond.

source: Enabling retention will prevent you from regenerating past day statistics with different prices (due to loss of accuracy).
nl: Het inschakelen van retentie heeft als gevolg dat je oude dagstatistieken niet opnieuw kan hergenereren met een andere prijs (door verlies van nauwkeurigheid).

source: PostgreSQL does not free up unused disk space immediately. If you've enabled retention for the first time, make sure to run the following command once after a few days::
nl: PostgreSQL geeft ongebruikte schijfruimte niet direct vrij. Wanneer je voor het eerst retentie hebt ingeschakeld, zorg er voor dat je na een aantal dagen het volgende ten minste één keer uitvoert::

source: How to enable
nl: Hoe in te schakelen

source: The admin configuration has a section called "Retention configuration". You can specify whether you want retention at all and set the lifetime of the data being stored.
nl: Het beheerder-paneel heeft een sectie genaamd "Retentieconfiguratie". Daar kun je aangeven of je überhaupt retentie wilt inschakelen, en zo ja, hoelang data bewaard blijft.

source: Data affected
nl: Geraakte gegevens

source: DSMR-readings
nl: DSMR-metingen

source: The source of all data. It is, however, only read and processed once, so it can be discarded safely after processing.
nl: De bron van alle gegevens. Ze worden echter slechts eenmaal ingelezen en kunnen, na verwerking, veilig worden verwijderd.

source: Electricity Consumption
nl: Elektriciteitsconsumptie

source: This is aggregated data either created from a single DSMR-reader or a minute worth of DSMR-readings, depending on whether you've enabled grouping.
nl: Geaggregeerde gegevens van ofwel een enkele DSMR-meting of een groep van DSMR-metingen, afhankelijk van je groeperingsinstellingen.

source: Gas Consumption
nl: Gasconsumptie

source: This data type is aggregated from any differences in 'extra device timestamp' occurrences in DSMR-readings.
nl: Dit data type is afkomstig van de gasmetergegevens uit de DSMR-metingen.

source: Data kept/unaffected
nl: Buitengesloten gegevens

source: Historic data, such as Hour and Day Statistics are unaffected. These are aggregated from the Electricity & Gas Consumption data above. This is also the only data that should matter when you want to look back to a specific day, month or year in the past.
nl: Historische gegevens, zoals Dag- en Uurstatistieken worden buiten beschouwing gelaten. Deze gegevens stammen af van bovenstaande consumptie en zijn tevens de enige belangrijke data die er voor de lange termijn toe doen. Bijvoorbeeld wanneer je terug wilt kijken naar een specifieke dag, maand of jaar.
