Repository: pyrocumulus/dsmr-reader
Catalog: docs/locale/*/LC_MESSAGES/screenshots.po
Languages: nl

source: Below you can find screenshots of the application.
nl: Hieronder vind je screenshots van de applicatie.

source: Contents
nl: Inhoudsopgave

source: The dashboard displays the latest information regarding any consumption of today and the current month so far.
nl: Het dashboard geeft de meest recente informatie weer over je energieverbruik van vandaag en de lopende maand tot nu toe.

source: Archive
nl: Archief

source: The archive allows you to go back to any moment tracked. The data can be plotted either on day, month or year level.
nl: Het archief stelt je in staat om terug in de tijd te gaan naar elk moment dat gemeten is met de applicatie. Gegevens kunnen getoond worden op verschillende detailniveaus: per dag, per maand en per jaar.

source: Compare
nl: Vergelijk

source: This page allows you to compare two days, months or years tracked before.
nl: Met deze pagina vergelijk je eenvoudig twee dagen, maanden of jaren met elkaar.

source: Trends are an average summary of your daily consumption and habits.
nl: Trends geven je gemiddelde energieverbruik en gewoontes weer.

source: Statistics
nl: Statistieken

source: The statistics page will display the current state of your meter and the energy prices currently apply (if any).
nl: De statistiekenpagina geeft de huidige staat van je slimme meter en de huidige energietarieven weer (wanneer van toepassing).

source: Energy contracts
nl: Energiecontracten

source: Summary of all your contracts and the amount of energy consumed/generated.
nl: Overzicht van alle energiecontracten en de hoeveelheid verbruikte/geleverde energie.

source: The status page shows the 'health' of the application and any data tracked. If there are any problems regarding data handling, they should be highlighted here.
nl: De statuspagina geeft de 'gezondheid' van de applicatie en die van de dataverwerking weer. Mochten er problemen zijn met het verzamelen van gegevens dan zou dat hier zichtbaar moeten zijn.

source: Export
nl: Exporteren

source: Want to export day totals or hourly data to Excel? This page allows you to export the data in .CSV format.
nl: Wil je alle dag- of uurtotalen exporteren om in Excel te bekijken? Dat kan via deze pagina door ze te exporteren in .CSV-formaat.

source: Settings: Overview
nl: Instellingen: Overzicht

source: The application has quite some features and most of them can be configured.
nl: De applicatie heeft behoorlijk wat mogelijkheden en de meesten daarvan stel je zelf in.

source: Settings: API
nl: Instellingen: API

source: Configure the API if you need it to supply telegrams or simply read data from DSMR-reader.
nl: Configureer de API wanneer je deze nodig hebt om telegrammen aan te leveren of om simpelweg gegevens uit DSMR-reader te lezen.

source: Settings: Backup & Dropbox
nl: Instellingen: Back-up & Dropbox

source: By default the application backs up your data locally.
nl: Standaard maakt de applicatie lokaal een back-up van de gegevens.

source: You can use your Dropbox-account to make sure your backups are safely stored in your account.
nl: Je kunt je Dropbox-account koppelen om ervoor te zorgen dat je back-ups veilig in je account staan.

source: Settings: Datalogger & retention
nl: Instellingen: Datalogger & retentie

source: Configure the builtin datalogger.
nl: Stel de ingebouwde datalogger in.

source: All source data read is stored indefinitely, but you can apply retention, only keeping the source data for a certain amount of time. Day statistics will never be deleted.
nl: Alle brondata wordt voor onbepaalde tijd bewaard. Je kunt echter retentie toepassen, waarbij de brondata slechts voor een bepaalde periode bewaard blijft. Dagstatistieken worden nooit opgeschoond.

source: Settings: Interface
nl: Instellingen: Interface

source: You can change most colors used in graphs to your personal flavor.
nl: De meeste kleuren in de grafieken kun je naar eigen wens aanpassen.

source: Settings: MinderGas.nl
nl: Instellingen: MinderGas.nl

source: Link your MinderGas.nl-account to have DSMR-reader upload your gas meter position daily.
nl: Koppel je MinderGas.nl-account om automatisch je gasmeterstanden elke dag te uploaden.

source: Settings: MQTT
nl: Instellingen: MQTT

source: There is support for MQTT messaging with a lot of options.
nl: Er is ondersteuning voor MQTT met een hoop verschillende opties.

source: Get the day totals as JSON.
nl: Haal de dagtotalen op in JSON-formaat.

source: Or splitted per topic.
nl: Of gesplitst per topic.

source: Statistics of your meter.
nl: Statistieken van je slimme meter.

source: Telegram as JSON.
nl: Telegram in JSON-formaat.

source: Or in raw format.
nl: Of in ruw formaat.

source: Settings: Notifications
nl: Instellingen: Notificaties

source: Notifications on your phone using Prowl or Pushover.
nl: Notificaties op je telefoon via Prowl of Pushover.

source: Settings: PVOutput
nl: Instellingen: PVOutput

source: Link your PVOutput account to upload your electricity returned.
nl: Koppel je PVOutput-account om je teruggeleverde electriciteit te uploaden.

source: Settings: Consumption
nl: Instellingen: Verbruik

source: Settings: Temperatures
nl: Instellingen: Temperaturen

source: Keep track of the temperatures outside using the Buienradar API.
nl: Houd de temperatuur buiten in de gaten via de Buienradar API.
